[NoCoverage] String mutation
Program.cs:14:34
         {
             WebHost.CreateDefaultBuilder(args)
                 .UseSerilog()
-                .UseHealthChecks("/hc")
+                .UseHealthChecks("")
                 .UseStartup<Startup>()
                 .Build()
