[NoCoverage] Boolean mutation
Startup.cs:49:70
 
             // Add framework services.
             services
-                .AddMvc((options) => options.EnableEndpointRouting = false)
+                .AddMvc((options) => options.EnableEndpointRouting = true)
                 .AddNewtonsoftJson();
 

[NoCoverage] String mutation
Startup.cs:62:36
             {
                 checks.WithDefaultCacheDuration(TimeSpan.FromSeconds(1));
                 checks.AddSqlCheck("EventStoreCN", _configuration.GetConnectionString("EventStoreCN"));
-                checks.AddSqlCheck("WorkshopManagementCN", _configuration.GetConnectionString("WorkshopManagementCN"));
+                checks.AddSqlCheck("", _configuration.GetConnectionString("WorkshopManagementCN"));
             });
         }

[NoCoverage] String mutation
Startup.cs:84:63
             // Enable middleware to serve swagger-ui (HTML, JS, CSS etc.), specifying the Swagger JSON endpoint.
             app.UseSwaggerUI(c =>
             {
-                c.SwaggerEndpoint("/swagger/v1/swagger.json", "WorkshopManagement API - v1");
+                c.SwaggerEndpoint("/swagger/v1/swagger.json", "");
             });
 
