[Killed] Negate expression
WorkshopManagementAPI/CommandHandlers/FinishMaintenanceJobCommandHandler.cs:26:17
         {
             // get planning
             WorkshopPlanning planning = await _planningRepo.GetWorkshopPlanningAsync(planningDate);
-            if (planning == null)
+            if (!(planning == null))
             {
                 return null;

[Killed] Equality mutation
WorkshopManagementAPI/CommandHandlers/FinishMaintenanceJobCommandHandler.cs:26:17
         {
             // get planning
             WorkshopPlanning planning = await _planningRepo.GetWorkshopPlanningAsync(planningDate);
-            if (planning == null)
+            if (planning != null)
             {
                 return null;
