[NoCoverage] Negate expression
WorkshopManagementAPI/Controllers/RefDataController.cs:31:17
         public async Task<IActionResult> GetCustomerByCustomerId(string customerId)
         {
             var customer = await _customerRepo.GetCustomerAsync(customerId);
-            if (customer == null)
+            if (!(customer == null))
             {
                 return NotFound();

[NoCoverage] Equality mutation
WorkshopManagementAPI/Controllers/RefDataController.cs:31:17
         public async Task<IActionResult> GetCustomerByCustomerId(string customerId)
         {
             var customer = await _customerRepo.GetCustomerAsync(customerId);
-            if (customer == null)
+            if (customer != null)
             {
                 return NotFound();

[NoCoverage] Negate expression
WorkshopManagementAPI/Controllers/RefDataController.cs:50:17
         public async Task<IActionResult> GetVehicleByLicenseNumber(string licenseNumber)
         {
             var vehicle = await _vehicleRepo.GetVehicleAsync(licenseNumber);
-            if (vehicle == null)
+            if (!(vehicle == null))
             {
                 return NotFound();

[NoCoverage] Equality mutation
WorkshopManagementAPI/Controllers/RefDataController.cs:50:17
         public async Task<IActionResult> GetVehicleByLicenseNumber(string licenseNumber)
         {
             var vehicle = await _vehicleRepo.GetVehicleAsync(licenseNumber);
-            if (vehicle == null)
+            if (vehicle != null)
             {
                 return NotFound();
