[NoCoverage] Equality mutation
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:41:21
             try
             {
                 var planning = await _planningRepo.GetWorkshopPlanningAsync(planningDate);
-                if (planning == null)
+                if (planning != null)
                 {
                     return NotFound();

[NoCoverage] Negate expression
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:41:21
             try
             {
                 var planning = await _planningRepo.GetWorkshopPlanningAsync(planningDate);
-                if (planning == null)
+                if (!(planning == null))
                 {
                     return NotFound();

[NoCoverage] Equality mutation
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:65:45
                 {
                     // get planning
                     WorkshopPlanning planning = await _planningRepo.GetWorkshopPlanningAsync(planningDate);
-                    if (planning == null || planning.Jobs == null)
+                    if (planning == null || planning.Jobs != null)
                     {
                         return NotFound();

[NoCoverage] Negate expression
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:65:25
                 {
                     // get planning
                     WorkshopPlanning planning = await _planningRepo.GetWorkshopPlanningAsync(planningDate);
-                    if (planning == null || planning.Jobs == null)
+                    if (!(planning == null || planning.Jobs == null))
                     {
                         return NotFound();

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:70:31
                         return NotFound();
                     }
                     // get job
-                    var job = planning.Jobs.FirstOrDefault(j => j.Id == jobId);
+                    var job = planning.Jobs.First(j => j.Id == jobId);
                     if (job == null)
                     {

[NoCoverage] Equality mutation
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:70:65
                         return NotFound();
                     }
                     // get job
-                    var job = planning.Jobs.FirstOrDefault(j => j.Id == jobId);
+                    var job = planning.Jobs.FirstOrDefault(j => j.Id != jobId);
                     if (job == null)
                     {

[NoCoverage] Equality mutation
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:71:25
                     }
                     // get job
                     var job = planning.Jobs.FirstOrDefault(j => j.Id == jobId);
-                    if (job == null)
+                    if (job != null)
                     {
                         return NotFound();

[NoCoverage] Negate expression
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:71:25
                     }
                     // get job
                     var job = planning.Jobs.FirstOrDefault(j => j.Id == jobId);
-                    if (job == null)
+                    if (!(job == null))
                     {
                         return NotFound();

[NoCoverage] Negate expression
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:101:29
                             _planMaintenanceJobCommandHandler.HandleCommandAsync(planningDate, command);
 
                         // handle result    
-                        if (planning == null)
+                        if (!(planning == null))
                         {
                             return NotFound();

[NoCoverage] Equality mutation
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:101:29
                             _planMaintenanceJobCommandHandler.HandleCommandAsync(planningDate, command);
 
                         // handle result    
-                        if (planning == null)
+                        if (planning != null)
                         {
                             return NotFound();

[NoCoverage] String mutation
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:107:47
                         }
 
                         // return result
-                        return CreatedAtRoute("GetByDate", new { planningDate = planning.Id }, planning);
+                        return CreatedAtRoute("", new { planningDate = planning.Id }, planning);
                     }
                     catch (BusinessRuleViolationException ex)

[NoCoverage] String mutation
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:152:39
             }
             catch (ConcurrencyException)
             {
-                string errorMessage = "Unable to save changes. " +
+                string errorMessage = "" +
                     "Try again, and if the problem persists " +
                     "see your system administrator.";

[NoCoverage] String mutation
WorkshopManagementAPI/Controllers/WorkshopPlanningController.cs:153:21
             catch (ConcurrencyException)
             {
                 string errorMessage = "Unable to save changes. " +
-                    "Try again, and if the problem persists " +
+                    "" +
                     "see your system administrator.";
                 Log.Error(errorMessage);
