[Killed] Negate expression
WorkshopManagementAPI/BusinessRules/MaintenanceJobRules.cs:10:17
     {
         public static void FinishedMaintenanceJobCanNotBeFinished(this MaintenanceJob job)
         {
-            if (job.Status == "Completed")
+            if (!(job.Status == "Completed"))
             {
                 throw new BusinessRuleViolationException($"An already finished job can not be finished.");

[Killed] Equality mutation
WorkshopManagementAPI/BusinessRules/MaintenanceJobRules.cs:10:17
     {
         public static void FinishedMaintenanceJobCanNotBeFinished(this MaintenanceJob job)
         {
-            if (job.Status == "Completed")
+            if (job.Status != "Completed")
             {
                 throw new BusinessRuleViolationException($"An already finished job can not be finished.");

[Killed] String mutation
WorkshopManagementAPI/BusinessRules/MaintenanceJobRules.cs:12:58
         {
             if (job.Status == "Completed")
             {
-                throw new BusinessRuleViolationException($"An already finished job can not be finished.");
+                throw new BusinessRuleViolationException($"");
             }
         }
