[Killed] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:17:17
         public static void PlannedMaintenanceJobShouldFallWithinOneBusinessDay(
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
-            if (command.StartTime.Date != command.EndTime.Date)
+            if (command.StartTime.Date == command.EndTime.Date)
             {
                 throw new BusinessRuleViolationException("Start-time and end-time of a Maintenance Job must be within a 1 day.");

[Killed] Negate expression
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:17:17
         public static void PlannedMaintenanceJobShouldFallWithinOneBusinessDay(
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
-            if (command.StartTime.Date != command.EndTime.Date)
+            if (!(command.StartTime.Date != command.EndTime.Date))
             {
                 throw new BusinessRuleViolationException("Start-time and end-time of a Maintenance Job must be within a 1 day.");

[Killed] Negate expression
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:26:17
         public static void NumberOfParallelMaintenanceJobsMustNotExceedAvailableWorkStations(
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
-            if (planning.Jobs.Count(j =>
-                (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
-                (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS)
+            if (!(planning.Jobs.Count(j =>
+                (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
+                (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS))
             {
                 throw new BusinessRuleViolationException($"Maintenancejob overlaps with more than {AVAILABLE_WORKSTATIONS} other jobs.");

[Killed] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:26:17
         public static void NumberOfParallelMaintenanceJobsMustNotExceedAvailableWorkStations(
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
-            if (planning.Jobs.Count(j =>
-                (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
-                (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS)
+            if (planning.Jobs.Count(j =>
+                (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
+                (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) < AVAILABLE_WORKSTATIONS)
             {
                 throw new BusinessRuleViolationException($"Maintenancejob overlaps with more than {AVAILABLE_WORKSTATIONS} other jobs.");

[Survived] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:27:54
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
             if (planning.Jobs.Count(j =>
-                (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
+                (j.StartTime >= command.StartTime && j.StartTime < command.EndTime) ||
                 (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS)
             {

[Survived] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:27:54
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
             if (planning.Jobs.Count(j =>
-                (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
+                (j.StartTime >= command.StartTime && j.StartTime > command.EndTime) ||
                 (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS)
             {

[NoCoverage] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:28:18
         {
             if (planning.Jobs.Count(j =>
                 (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
-                (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS)
+                (j.EndTime < command.StartTime  && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS)
             {
                 throw new BusinessRuleViolationException($"Maintenancejob overlaps with more than {AVAILABLE_WORKSTATIONS} other jobs.");

[NoCoverage] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:28:52
         {
             if (planning.Jobs.Count(j =>
                 (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
-                (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS)
+                (j.EndTime >= command.StartTime && j.EndTime > command.EndTime)) >= AVAILABLE_WORKSTATIONS)
             {
                 throw new BusinessRuleViolationException($"Maintenancejob overlaps with more than {AVAILABLE_WORKSTATIONS} other jobs.");

[Killed] String mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:30:58
                 (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime) ||
                 (j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)) >= AVAILABLE_WORKSTATIONS)
             {
-                throw new BusinessRuleViolationException($"Maintenancejob overlaps with more than {AVAILABLE_WORKSTATIONS} other jobs.");
+                throw new BusinessRuleViolationException($"");
             }
         }

[Killed] Negate expression
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:37:17
         public static void NumberOfParallelMaintenanceJobsOnAVehicleIsOne(
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
-            if (planning.Jobs.Any(j => j.Vehicle.Id == command.VehicleInfo.LicenseNumber &&
-                    (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
-                    j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
+            if (!(planning.Jobs.Any(j => j.Vehicle.Id == command.VehicleInfo.LicenseNumber &&
+                    (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
+                    j.EndTime >= command.StartTime && j.EndTime <= command.EndTime))))
             {
                 throw new BusinessRuleViolationException($"Only 1 maintenance job can be executed on a vehicle during a certain time-slot.");

[Killed] Linq method mutation (Any() to All())
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:37:17
         public static void NumberOfParallelMaintenanceJobsOnAVehicleIsOne(
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
-            if (planning.Jobs.Any(j => j.Vehicle.Id == command.VehicleInfo.LicenseNumber &&
-                    (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
-                    j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
+            if (planning.Jobs.All(j => j.Vehicle.Id == command.VehicleInfo.LicenseNumber &&
+                    (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
+                    j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
             {
                 throw new BusinessRuleViolationException($"Only 1 maintenance job can be executed on a vehicle during a certain time-slot.");

[Survived] Logical mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:38:22
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
             if (planning.Jobs.Any(j => j.Vehicle.Id == command.VehicleInfo.LicenseNumber &&
-                    (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
-                    j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
+                    (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime &&
+                    j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
             {
                 throw new BusinessRuleViolationException($"Only 1 maintenance job can be executed on a vehicle during a certain time-slot.");

[Survived] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:38:22
             this WorkshopPlanning planning, PlanMaintenanceJob command)
         {
             if (planning.Jobs.Any(j => j.Vehicle.Id == command.VehicleInfo.LicenseNumber &&
-                    (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
+                    (j.StartTime < command.StartTime  && j.StartTime <= command.EndTime ||
                     j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
             {

[NoCoverage] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:39:21
         {
             if (planning.Jobs.Any(j => j.Vehicle.Id == command.VehicleInfo.LicenseNumber &&
                     (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
-                    j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
+                                        j.EndTime > command.StartTime  && j.EndTime <= command.EndTime)))
             {
                 throw new BusinessRuleViolationException($"Only 1 maintenance job can be executed on a vehicle during a certain time-slot.");

[NoCoverage] Equality mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:39:55
         {
             if (planning.Jobs.Any(j => j.Vehicle.Id == command.VehicleInfo.LicenseNumber &&
                     (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
-                    j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
+                    j.EndTime >= command.StartTime && j.EndTime < command.EndTime)))
             {
                 throw new BusinessRuleViolationException($"Only 1 maintenance job can be executed on a vehicle during a certain time-slot.");

[Killed] String mutation
WorkshopManagementAPI/BusinessRules/WorkshopPlanningRules.cs:41:58
                     (j.StartTime >= command.StartTime && j.StartTime <= command.EndTime ||
                     j.EndTime >= command.StartTime && j.EndTime <= command.EndTime)))
             {
-                throw new BusinessRuleViolationException($"Only 1 maintenance job can be executed on a vehicle during a certain time-slot.");
+                throw new BusinessRuleViolationException($"");
             }
         }
