[Survived] Boolean mutation
WorkshopManagementAPI/Core/AggregateRoot.cs:23:50
         /// <summary>
         /// Indication whether the aggregate is replaying events (true) or not (false).
         /// </summary>
-        private bool IsReplaying { get; set; } = false;
+        private bool IsReplaying { get; set; } = true;
                 
         /// <summary>

[Survived] Boolean mutation
WorkshopManagementAPI/Core/AggregateRoot.cs:54:27
         /// <param name="events">The events to replay.</param>
         public AggregateRoot(TId id, IEnumerable<Event> events) : this(id)
         {
-            IsReplaying = true;
+            IsReplaying = false;
             foreach (Event e in events)
             {

[Killed] PostIncrementExpression to PostDecrementExpression mutation
WorkshopManagementAPI/Core/AggregateRoot.cs:58:17
             foreach (Event e in events)
             {
                 When(e);
-                OriginalVersion++;
+                                OriginalVersion--;
                 Version++;
             }

[Killed] PostIncrementExpression to PostDecrementExpression mutation
WorkshopManagementAPI/Core/AggregateRoot.cs:59:17
             {
                 When(e);
                 OriginalVersion++;
-                Version++;
+                                Version--;
             }
             IsReplaying = false;

[Survived] Boolean mutation
WorkshopManagementAPI/Core/AggregateRoot.cs:61:27
                 OriginalVersion++;
                 Version++;
             }
-            IsReplaying = false;
+            IsReplaying = true;
         }
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
WorkshopManagementAPI/Core/AggregateRoot.cs:85:13
 
             // save the event so it can be published outside the aggregate
             _events.Add(@event);
-            Version += 1;
+                        Version -=1;
         }
 
