[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
WorkshopManagementAPI/Entities/MaintenanceJob.cs:19:63
         public DateTime? ActualStartTime { get; private set; }
         public DateTime? ActualEndTime { get; private set; }
         public string Notes { get; private set; }
-        public string Status => (!ActualStartTime.HasValue && !ActualEndTime.HasValue) ? "Planned" : "Completed";
+        public string Status => (!ActualStartTime.HasValue && ActualEndTime.HasValue) ? "Planned" : "Completed";
 
         public void Plan(Guid id, DateTime startTime, DateTime endTime, Vehicle vehicle, Customer customer, string description)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
WorkshopManagementAPI/Entities/MaintenanceJob.cs:19:34
         public DateTime? ActualStartTime { get; private set; }
         public DateTime? ActualEndTime { get; private set; }
         public string Notes { get; private set; }
-        public string Status => (!ActualStartTime.HasValue && !ActualEndTime.HasValue) ? "Planned" : "Completed";
+        public string Status => (ActualStartTime.HasValue  && !ActualEndTime.HasValue) ? "Planned" : "Completed";
 
         public void Plan(Guid id, DateTime startTime, DateTime endTime, Vehicle vehicle, Customer customer, string description)
