[NoCoverage] Logical mutation
WorkshopManagementAPI/ValueObjects/WorkshopPlanningId.cs:20:17
 
         public override bool Equals(object obj)
         {
-            if (obj == null || GetType() != obj.GetType())
+            if (obj == null && GetType() != obj.GetType())
             {
                 return false;

[NoCoverage] Equality mutation
WorkshopManagementAPI/ValueObjects/WorkshopPlanningId.cs:20:32
 
         public override bool Equals(object obj)
         {
-            if (obj == null || GetType() != obj.GetType())
+            if (obj == null || GetType() == obj.GetType())
             {
                 return false;
