[Killed] Equality mutation
WorkshopManagementAPI/Domain/WorkshopPlanning.cs:54:59
         public void FinishMaintenanceJob(FinishMaintenanceJob command)
         {
             // find job
-            MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id == command.JobId);
+            MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id != command.JobId);
             if (job == null)
             {

[Survived] Linq method mutation (FirstOrDefault() to First())
WorkshopManagementAPI/Domain/WorkshopPlanning.cs:54:34
         public void FinishMaintenanceJob(FinishMaintenanceJob command)
         {
             // find job
-            MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id == command.JobId);
+            MaintenanceJob job = Jobs.First(j => j.Id == command.JobId);
             if (job == null)
             {

[Killed] Equality mutation
WorkshopManagementAPI/Domain/WorkshopPlanning.cs:55:17
         {
             // find job
             MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id == command.JobId);
-            if (job == null)
+            if (job != null)
             {
                 throw new MaintenanceJobNotFoundException($"Maintenance job with id {command.JobId} found.");

[Killed] Negate expression
WorkshopManagementAPI/Domain/WorkshopPlanning.cs:55:17
         {
             // find job
             MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id == command.JobId);
-            if (job == null)
+            if (!(job == null))
             {
                 throw new MaintenanceJobNotFoundException($"Maintenance job with id {command.JobId} found.");

[NoCoverage] String mutation
WorkshopManagementAPI/Domain/WorkshopPlanning.cs:57:59
             MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id == command.JobId);
             if (job == null)
             {
-                throw new MaintenanceJobNotFoundException($"Maintenance job with id {command.JobId} found.");
+                throw new MaintenanceJobNotFoundException($"");
             }
 

[Killed] Equality mutation
WorkshopManagementAPI/Domain/WorkshopPlanning.cs:94:59
 
         private void Handle(MaintenanceJobFinished e)
         {
-            MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id == e.JobId);
+            MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id != e.JobId);
             job.Finish(e.StartTime, e.EndTime, e.Notes);
         }

[Survived] Linq method mutation (FirstOrDefault() to First())
WorkshopManagementAPI/Domain/WorkshopPlanning.cs:94:34
 
         private void Handle(MaintenanceJobFinished e)
         {
-            MaintenanceJob job = Jobs.FirstOrDefault(j => j.Id == e.JobId);
+            MaintenanceJob job = Jobs.First(j => j.Id == e.JobId);
             job.Finish(e.StartTime, e.EndTime, e.Notes);
         }
