[NoCoverage] Negate expression
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:28:25
                 {
                     var customersSelection = await conn.QueryAsync<Customer>("select * from Customer");
 
-                    if (customersSelection != null)
+                    if (!(customersSelection != null))
                     {
                         customers.AddRange(customersSelection);

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:28:25
                 {
                     var customersSelection = await conn.QueryAsync<Customer>("select * from Customer");
 
-                    if (customersSelection != null)
+                    if (customersSelection == null)
                     {
                         customers.AddRange(customersSelection);

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:50:75
             {
                 try
                 {
-                    var vehicleSelection = await conn.QueryAsync<Vehicle>("select * from Vehicle");
+                    var vehicleSelection = await conn.QueryAsync<Vehicle>("");
 
                     if (vehicleSelection != null)

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:52:25
                 {
                     var vehicleSelection = await conn.QueryAsync<Vehicle>("select * from Vehicle");
 
-                    if (vehicleSelection != null)
+                    if (vehicleSelection == null)
                     {
                         vehicles.AddRange(vehicleSelection);

[NoCoverage] Negate expression
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:52:25
                 {
                     var vehicleSelection = await conn.QueryAsync<Vehicle>("select * from Vehicle");
 
-                    if (vehicleSelection != null)
+                    if (!(vehicleSelection != null))
                     {
                         vehicles.AddRange(vehicleSelection);

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:90:74
             {
                 try
                 {
-                    return await conn.QueryFirstOrDefaultAsync<Customer>("select * from Customer where CustomerId = @CustomerId",
+                    return await conn.QueryFirstOrDefaultAsync<Customer>("",
                         new { CustomerId = customerId });
                 }

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:104:17
 
         private static void HandleSqlException(SqlException ex)
         {
-            if (ex.Errors.Count > 0)
+            if (ex.Errors.Count < 0)
             {
                 for (int i = 0; i < ex.Errors.Count; i++)

[NoCoverage] Negate expression
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:104:17
 
         private static void HandleSqlException(SqlException ex)
         {
-            if (ex.Errors.Count > 0)
+            if (!(ex.Errors.Count > 0))
             {
                 for (int i = 0; i < ex.Errors.Count; i++)

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:106:33
         {
             if (ex.Errors.Count > 0)
             {
-                for (int i = 0; i < ex.Errors.Count; i++)
+                for (int i = 0; i <= ex.Errors.Count; i++)
                 {
                     if (ex.Errors[i].Number == 4060)

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:106:33
         {
             if (ex.Errors.Count > 0)
             {
-                for (int i = 0; i < ex.Errors.Count; i++)
+                for (int i = 0; i > ex.Errors.Count; i++)
                 {
                     if (ex.Errors[i].Number == 4060)

[NoCoverage] Negate expression
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:108:25
             {
                 for (int i = 0; i < ex.Errors.Count; i++)
                 {
-                    if (ex.Errors[i].Number == 4060)
+                    if (!(ex.Errors[i].Number == 4060))
                     {

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerRefDataRepository.cs:108:25
             {
                 for (int i = 0; i < ex.Errors.Count; i++)
                 {
-                    if (ex.Errors[i].Number == 4060)
+                    if (ex.Errors[i].Number != 4060)
                     {
