[NoCoverage] Negate expression
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:55:21
                             "select * from WorkshopPlanning where Id = @Id", 
                             new { Id = date.ToString("yyyy-MM-dd") });
                 
-                if (aggregate == null)
+                if (!(aggregate == null))
                 {
                     return null;

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:55:21
                             "select * from WorkshopPlanning where Id = @Id", 
                             new { Id = date.ToString("yyyy-MM-dd") });
                 
-                if (aggregate == null)
+                if (aggregate != null)
                 {
                     return null;

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:64:50
                 IEnumerable<AggregateEvent> aggregateEvents = await conn
                     .QueryAsync<AggregateEvent>(
                         "select * from WorkshopPlanningEvent where Id = @Id order by [Version];",
-                        new { Id = date.ToString("yyyy-MM-dd") });
+                        new { Id = date.ToString("") });
             
                 List<Event> events = new List<Event>();

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:93:29
                     int affectedRows = 0;
                     var aggregate = await conn
                         .QuerySingleOrDefaultAsync<Aggregate>(
-                            "select * from WorkshopPlanning where Id = @Id", 
+                            "", 
                             new { Id = planningId },
                             transaction);

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:97:25
                             new { Id = planningId },
                             transaction);
 
-                    if (aggregate != null)
+                    if (aggregate == null)
                     {
                         // update existing aggregate

[NoCoverage] Negate expression
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:97:25
                             new { Id = planningId },
                             transaction);
 
-                    if (aggregate != null)
+                    if (!(aggregate != null))
                     {
                         // update existing aggregate

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:101:29
                     {
                         // update existing aggregate
                         affectedRows = await conn.ExecuteAsync(
-                            @"update WorkshopPlanning
-                              set [CurrentVersion] = @NewVersion
-                              where [Id] = @Id
-                              and [CurrentVersion] = @CurrentVersion;",
+                            "",
                             new { 
                                 Id = planningId, 

[NoCoverage] Negate expression
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:122:25
                     }
 
                     // check concurrency
-                    if (affectedRows == 0)
+                    if (!(affectedRows == 0))
                     {
                         transaction.Rollback();

[NoCoverage] Equality mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:122:25
                     }
 
                     // check concurrency
-                    if (affectedRows == 0)
+                    if (affectedRows != 0)
                     {
                         transaction.Rollback();

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:132:25
                     int eventVersion = originalVersion;
                     foreach (var e in newEvents)
                     {
-                        eventVersion++;
+                                                eventVersion--;
                         await conn.ExecuteAsync(
                             @"insert WorkshopPlanningEvent ([Id], [Version], [Timestamp], [MessageType], [EventData])

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:134:29
                     {
                         eventVersion++;
                         await conn.ExecuteAsync(
-                            @"insert WorkshopPlanningEvent ([Id], [Version], [Timestamp], [MessageType], [EventData])
-                              values (@Id, @NewVersion, @Timestamp, @MessageType,@EventData);",
+                            "",
                             new { 
                                 Id = planningId, 

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:161:45
                 Policy
                     .Handle<Exception>()
                     .WaitAndRetry(5, r => TimeSpan.FromSeconds(5), (ex, ts) => 
-                        { Console.WriteLine("Error connecting to DB. Retrying in 5 sec."); })
+                        { Console.WriteLine(""); })
                     .Execute(() => conn.Open());
 

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:165:30
                     .Execute(() => conn.Open());
 
                 // create database
-                string sql = "if DB_ID('WorkshopManagementEventStore') IS NULL CREATE DATABASE WorkshopManagementEventStore;";
+                string sql = "";
                 conn.Execute(sql);
 

[NoCoverage] String mutation
WorkshopManagementAPI/Repositories/SqlServerWorkshopPlanningRepository.cs:170:23
 
                 // create tables
                 conn.ChangeDatabase("WorkshopManagementEventStore");
-                sql = @" 
-                    if OBJECT_ID('WorkshopPlanning') IS NULL 
-                    CREATE TABLE WorkshopPlanning (
-                        [Id] varchar(50) NOT NULL,
-                        [CurrentVersion] int NOT NULL,
-                    PRIMARY KEY([Id]));
-                   
-                    if OBJECT_ID('WorkshopPlanningEvent') IS NULL
-                    CREATE TABLE WorkshopPlanningEvent (
-                        [Id] varchar(50) NOT NULL REFERENCES WorkshopPlanning([Id]),
-                        [Version] int NOT NULL,
-                        [Timestamp] datetime2(7) NOT NULL,
-                        [MessageType] varchar(75) NOT NULL,
-                        [EventData] text,
-                    PRIMARY KEY([Id], [Version]));";
+                sql = "";
                 conn.Execute(sql);
             }
